Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthsForArcsDisplayOption Property
 "Arc Segment Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthsForArcsDisplayOption { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthsForArcsDisplayOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthsForArcsDisplayOption {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthsForArcsDisplayOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace